backend/controllers/PostController.php

INSERT INTO `post` (`author_id`, `title`) VALUES (1, 'Bocah tua nakal')
---
    public function actionCreate()
    {
        $model = new Post();

        if (!Yii::$app->user->can('createPost')) {
            throw new \yii\web\HttpException(404, 'The requested Item could not be found.');
        }
        $model->author_id = yii::$app->user->id;
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

UPDATE `post` SET `title`='Ini bekas di edit user', `author_id`=2 WHERE `id`=1
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if (!Yii::$app->user->can('updatePost')) {
            throw new \yii\web\HttpException(404, 'The requested Item could not be found.');
        }
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `post` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {